app/views/users/show.html.erb

        <div class="reservations_table">
          <% @user.reservations.each do |reservation| %>
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 1]]

        <div class="user_reviews_display">
          <% @user.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 1]]