app/views/restaurants/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 6]]
---
<div class="restaurant_review_list">
  <h3><% @restaurant.reviews.each do |review| %></h3>