app/controllers/owners_controller.rb

INSERT INTO "owners" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "yuan@gmail.com"], ["password_digest", "$2a$10$2t3i5Yhit98IWLT86oQo3uCxhLTZKRikZWLjUtNbpbEgPKRLKiOEO"], ["created_at", 2016-11-13 16:49:41 UTC], ["updated_at", 2016-11-13 16:49:41 UTC]]
---
  def create
    @owner = Owner.new(owner_params)
    if @owner.save