app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "phone", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "hey@gmail.com"], ["phone", "12324"], ["name", "hey you"], ["created_at", 2016-11-11 23:45:25 UTC], ["updated_at", 2016-11-11 23:45:25 UTC]]

  def update
    @user = User.find(params[:id])

    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "phone" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["phone", "12324567"], ["password_digest", "$2a$10$n7FaCqnmK6K3/GcCxIEuLudZBPSE5Y97uqZpHW.YX2pgFnzl8D.fG"], ["updated_at", 2016-11-12 00:09:35 UTC], ["id", 1]]